{
    "projects": [
        {
            "name": "Personal Site",
            "description": "This site! A place to list off some of my work. Built with React on top of TypeScript it was primarily designed to be fast and accessible, and scores well on Lighthouse and Googles Mobile-Friendly test. To achieve this, a minimalist approach was taken. With few images, and what images there are being SVG's to reduce page size. Other speed gains are achieved by using Cloudfront as the CDN and using as few external dependencies as possible.",
            "technologies": [
                "React",
                "TypeScript",
                "SCSS",
                "AWS",
                "Yarn",
                "webpack"
            ],
            "link": "https://github.com/ataylor95/personal-site"
        },
        {
            "name": "TalkTalk Web Component Library",
            "description": "Part of the team that built this project at TalkTalk, it is a StencilJS based library designed to allow quick and easy reuse of UI components across multiple technology stacks. It allowed us to quickly build pages that conformed to our UI/UX standards and was open to server side rendering in the future. We also used Storybook to display and document this library. Click this card for the speedcheck page, which is built entirely using this library.",
            "technologies": [
                "Web Components",
                "Stencil",
                "Storybook",
                "TypeScript",
                "SCSS",
                "Yarn",
                "webpack"
            ],
            "link": "https://www.talktalk.co.uk/speedcheck"
        },
        {
            "name": "Contentful Meetup Talk",
            "description": "A colleague and I gave a talk at a meetup for Contentful developers, Contentful is a headless CMS used for content on the TalkTalk shop site. The talk was about how we built our Web Components to pull data from the CMS. This therefore allowed us to build entire sites/ applications that conformed to our design standards in very little time all through the CMS interface, dramatically reducing developer time needed. Click for the video.",
            "technologies": [
                "Contentful",
                "Web Components",
                "Stencil"
            ],
            "link": "https://www.youtube.com/watch?v=4wxCQowDEs4"
        },
        {
            "name": "TalkTalk Online Integration with Azure",
            "description": "Lead the migration away from AWS to Azure for the Online Department in TalkTalk. In particular it involved designing and building the pipelines and hosting solution for the new Web Components and Micro Frontend Architecture.",
            "technologies": [
                "Azure",
                "Azure Pipelines",
                "Yarn"
            ],
            "link": "https://www.talktalk.co.uk/shop"
        },
        {
            "name": "TalkTalk Sales CMS",
            "description": "Using Contentful as a headless CMS I was part of the team that implemented the use of the CMS across TT's main site, an AngularJS application. The aim was to decrease the time to edit content and remove the need for developers to perform those changes. For example, we reduced making copy changes from 2 weeks to 2 minutes.",
            "technologies": [
                "Angular",
                "SCSS",
                "Contentful",
                "AWS",
                "Yarn"
            ],
            "link": "https://www.talktalk.co.uk/shop"
        },
        {
            "name": "Classroom Quiz Application",
            "description": "A PHP Laravel application used by teachers and lecturers to allow students to answer questions and display those responses in real time. A lecturer could upload a PDF of slides, and then embed questions in between those slides. Students would connect to the application via a session password on their devices and answer these questions, which the lecturer could display the results of immediately. Web sockets were used to achieve this real time communication.",
            "technologies": [
                "PHP",
                "Laravel",
                "MySQL",
                "npm",
                "SCSS"
            ],
            "link": "https://github.com/ataylor95/quiz-system"
        },
        {
            "name": "Cornwalls Cottages",
            "description": "Main developer on this project whilst working at Gloversure (2015-2016), a site for renting cottages. Noteworthy is the search page, built in React, so that users can search ineractively via a map or via normal search filters. The remainder of the site is built with PHP.",
            "technologies": [
                "PHP",
                "React",
                "MySQL",
                "npm"
            ],
            "link": "https://gloversure.co.uk/portfolio/cornwalls-cottages"
        }
    ]
}